# Chipotle data

In [1]:
# importing libraries

In [2]:
import pandas as pd
import numpy as np

In [3]:
# load dataset

In [10]:

url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
df_1 = pd.read_csv(url, sep = '\t')

In [11]:
# first 5 column
df_1.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [12]:
#last 5 column

df_1.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [16]:
# number fo observation in dataset

df_1.shape[0]

4622

In [17]:
# number of column in dataset

df_1.shape[1]

5

In [20]:
# all column name

df_1.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [21]:
# how dataset indexes

df_1.index

RangeIndex(start=0, stop=4622, step=1)

In [34]:
# which is the most ordered item

s = df_1.groupby("item_name")
s = s.sum()
s = s.sort_values(["quantity"],ascending = False)
s.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [71]:
# another way - most order_item
value_counts = df_1.item_name.value_counts()
value_counts.head()

Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Steak Burrito          368
Canned Soft Drink      301
Name: item_name, dtype: int64

In [35]:
# how many item whre orderd in total

df_1.quantity.sum()

4972

In [43]:
# column data type
df_1.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [51]:
# covert item price into float

df_1.item_price.astype("float64")
df_1.item_price.dtype

dtype('float64')

In [53]:
# how much was revenue

revenue = (df_1.quantity * df_1.item_price).sum()
revenue

39237.02

In [56]:
# how many order were made
df_1.order_id.nunique()

1834

In [62]:
# different way - total order
total_orders = df_1.order_id.value_counts().count()
total_orders

1834

In [61]:
# average revenue per order
c = revenue / total_orders
c

21.39423118865867

In [63]:
# how many different item were sold
df_1.item_name.nunique()

50

In [72]:
df_1.item_name.value_counts().count()

50